fedetft/miosix-kernel-unofficial/miosix/arch/cortexM3_efm32gg/efm32gg332f1024_wandstem/interfaces-impl/transceiver.cpp
    DeepSleepLock dslck;

    auto misoPin=internalSpi::miso::getPin();
    FastInterruptDisableLock dLock;
    waiting=Thread::IRQgetCurrentThread();
    IRQenableGpioIrq(misoPin);
    do {
        Thread::IRQwait();
        {
            FastInterruptEnableLock eLock(dLock);
            Thread::yield();
        }
    } while(waiting);
    IRQdisableGpioIrq(misoPin);
}

unsigned char Transceiver::txPower(int dBm)
{
    CC2520TxPower result;
    if(dBm>=5)       result=CC2520TxPower::P_5;
    else if(dBm>=3)  result=CC2520TxPower::P_3;
    else if(dBm==2)  result=CC2520TxPower::P_2;
    else if(dBm==1)  result=CC2520TxPower::P_1;
    else if(dBm==0)  result=CC2520TxPower::P_0;
    else if(dBm>=-2) result=CC2520TxPower::P_m2;
    else if(dBm>=-7) result=CC2520TxPower::P_m7;
    else             result=CC2520TxPower::P_m18;
    return toByte(result);
}

short int Transceiver::decodeRssi(unsigned char reg)
{
    int rawRssi=static_cast<int>(reg);
    if(rawRssi & 0x80) rawRssi-=256; //8 bit 2's complement to int
    return rawRssi-76; //See datasheet
}

void Transceiver::enableTransceiverPowerDomain()
{
    Lock<FastMutex> plock(powerMutex);

    if(transceiverPowerDomainRefCount == 0)
    {
        //Enable power domain
        transceiver::vregEn::high();
        transceiver::reset::low();
        
        //The voltage at the the flash rises in about 70us,
        //observed using an oscilloscope. The voltage at the
        //transceiver is even faster, but the spec says 100us
        //TODO: power hungry, but we can't use the rtc as only one thread
        //can use it at a time, and we may be called by another thread
        delayUs(100);
        
        transceiver::cs::high();

        flash::cs::high();
        flash::hold::high();
        
        spi.enable();
    }

    ++transceiverPowerDomainRefCount;
}

void Transceiver::disableTransceiverPowerDomain()
{
    Lock<FastMutex> plock(powerMutex);

    --transceiverPowerDomainRefCount;

    if(transceiverPowerDomainRefCount==0)
    {
        //Disable power domain
        spi.disable();
        
        flash::hold::low();
        flash::cs::low();
        
        transceiver::reset::low();
        transceiver::cs::low();
        
        transceiver::vregEn::low();
    } else if(transceiverPowerDomainRefCount<0) {
        throw runtime_error("transceiver power domain refcount is negative");
    }
}

} //namespace miosix
